const String minDatetime = '1950-05-12';
const String maxDatetime = '2050-05-12';


const Map<String, String> lunarFestival = {
  '12-30': '除夕',
  '1-1': '春节',
  '1-15': '元宵节',
  '5-5': '端午节',
  '8-15': '中秋节',
  '9-9': '重阳节',
};
// 阳历节日
const Map<String, String> solarFestival = {
  '1-1': '元旦节',
  '2-14': '情人节',
  '5-1': '劳动节',
  '5-4': '青年节',
  '6-1': '儿童节',
  '9-10': '教师节',
  '10-1': '国庆节',
  '12-25': '圣诞节',
  '3-8': '妇女节',
  '3-12': '植树节',
  '4-1': '愚人节',
  '5-12': '护士节',
  '7-1': '建党节',
  '8-1': '建军节',
  '12-24': '平安夜',
};
